<script setup lang="ts">

</script>

<template>
  <section class="aboutus">
    <h1 class="aboutus__title">
      О нас
    </h1>
    <p class="aboutus__text">
      Мы — команда студентов, которая решила создать удобный и эффективный онлайн-тренажёр для подготовки к экзаменам ГИМС. Наш проект появился из личного интереса и желания помочь другим успешно пройти экзамен, не тратя время на сложные и неудобные материалы. Мы верим, что качественная подготовка может быть доступной, интерактивной и приятной для каждого пользователя.
    </p>
    <p class="aboutus__text">
      За визуальную и фронтенд-часть нашего тренажёра отвечает Баженов Кирилл. Он занимается разработкой интерфейса, стараясь сделать его максимально простым и удобным. Благодаря его работе наш тренажёр выглядит привлекательно, понятен пользователям любого уровня подготовки и позволяет легко отслеживать прогресс обучения.
    </p>
    <p class="aboutus__text">
      Технической частью и серверной разработкой занимается Бобров Кирилл. Он отвечает за backend-программирование, обеспечивая надёжность, скорость работы и безопасность данных пользователей. Его главная задача — чтобы приложение стабильно выдерживало большие нагрузки и бесперебойно функционировало, независимо от количества одновременно обучающихся пользователей.
    </p>
    <p class="aboutus__text">
      Настройка серверов и автоматизация процессов разработки находятся в руках Болучевской Ксении, нашего DevOps-специалиста. Она следит за тем, чтобы все изменения и обновления мгновенно попадали к пользователям, а процессы развёртывания и поддержки приложения проходили максимально гладко. Благодаря её работе наша команда быстро реагирует на любые проблемы и улучшает тренажёр буквально на ходу.
    </p>
    <p class="aboutus__text">
      Вместе мы стремимся создать продукт, который будет полезен каждому, кто готовится к экзамену ГИМС. Мы открыты для предложений и обратной связи, так как постоянно развиваем и улучшаем наш тренажёр. Для нас важно, чтобы подготовка к экзаменам стала не только проще, но и приятнее!
    </p>
  </section>
</template>

<style scoped lang="scss">
.aboutus {
    max-width: 1400px;
    width: 100%;
    margin: 30px auto;
}

.aboutus__title {
  text-transform: uppercase;
  font-size: 50px;
  font-family: 'Merriweather', sans-serif;
  margin: 0 0 30px 0;
  padding: 0;
  color: #213341;
}

.aboutus__text {
  text-transform: uppercase;
  font-size: 16px;
  font-family: 'Martian Mono', serif;
  margin: 0;
  padding: 0;
  max-width: 50%;
}

.aboutus__text:not(:last-child) {
  margin-bottom: 30px;
}
</style>
