<script setup lang="ts">

</script>

<template>
  <!--  <section class="aboutus"> -->
  <!--    <h1 class="aboutus__title"> -->
  <!--      О нас -->
  <!--    </h1> -->
  <!--    <p class="aboutus__text"> -->
  <!--      Мы — команда студентов, которая решила создать удобный и эффективный онлайн-тренажёр для подготовки к экзаменам ГИМС. Наш проект появился из личного интереса и желания помочь другим успешно пройти экзамен, не тратя время на сложные и неудобные материалы. Мы верим, что качественная подготовка может быть доступной, интерактивной и приятной для каждого пользователя. -->
  <!--    </p> -->
  <!--    <p class="aboutus__text"> -->
  <!--      За визуальную и фронтенд-часть нашего тренажёра отвечает Баженов Кирилл. Он занимается разработкой интерфейса, стараясь сделать его максимально простым и удобным. Благодаря его работе наш тренажёр выглядит привлекательно, понятен пользователям любого уровня подготовки и позволяет легко отслеживать прогресс обучения. -->
  <!--    </p> -->
  <!--    <p class="aboutus__text"> -->
  <!--      Технической частью и серверной разработкой занимается Бобров Кирилл. Он отвечает за backend-программирование, обеспечивая надёжность, скорость работы и безопасность данных пользователей. Его главная задача — чтобы приложение стабильно выдерживало большие нагрузки и бесперебойно функционировало, независимо от количества одновременно обучающихся пользователей. -->
  <!--    </p> -->
  <!--    <p class="aboutus__text"> -->
  <!--      Настройка серверов и автоматизация процессов разработки находятся в руках Болучевской Ксении, нашего DevOps-специалиста. Она следит за тем, чтобы все изменения и обновления мгновенно попадали к пользователям, а процессы развёртывания и поддержки приложения проходили максимально гладко. Благодаря её работе наша команда быстро реагирует на любые проблемы и улучшает тренажёр буквально на ходу. -->
  <!--    </p> -->
  <!--    <p class="aboutus__text"> -->
  <!--      Вместе мы стремимся создать продукт, который будет полезен каждому, кто готовится к экзамену ГИМС. Мы открыты для предложений и обратной связи, так как постоянно развиваем и улучшаем наш тренажёр. Для нас важно, чтобы подготовка к экзаменам стала не только проще, но и приятнее! -->
  <!--    </p> -->
  <!--  </section> -->

  <section class="error">
    <h1 class="error__code">
      Извините :(
    </h1>

    <p class="error__title">
      но страница еще не готова, мы очень стараемся чтоб она появилась как можно скорее
    </p>

    <NLink
      class="error__link"
      to="/"
    >
      На главную
    </NLink>
  </section>
</template>

<style scoped lang="scss">
.error {
  width: 100%;
  height: 100vh;

  display: flex;
  flex-direction: column;
  justify-content: center;
  align-items: center;
  gap: 42px;

  padding: 0 16px;

  &__code {
    font-size: 63px;
    line-height: 70px;

    margin: 0;
  }

  &__title {
    font-size: 44px;
    line-height: 46px;
    text-align: center;
    margin: 0;
  }

  &__subtitle {
    font-size: 24px;
    line-height: 32px;
    text-align: center;

    margin: 0;
    width: 80%;
  }

  &__link {
    background-color: $accent;

    font-size: 33px;
    line-height: 36px;
    color: #fff;

    padding: 24px 36px;
    margin: 16px 0 0;
    cursor: pointer;
  }
}
</style>
